Repository: slackjeff/debloated_Samsung
Catalog: usr/share/doc/debloat-android/locale/debloat-android-*.po
Languages: pt_br

source: adb shell pm clear package.name 📌 What it does: This command clears all data and cache for an app, as if you had gone to "Settings > Apps > Clear Data". ✅ Works on: All modern versions of Android, from Android 5.0 (Lollipop) to 14 (with some variations). As long as the app is installed on the current user (usually user 0). ⚠️ Limitations: On Android 11+ (API 30+), some system-protected or enterprise-profile apps may not be cleared. If the app is a system app, you may need to be rooted to clear everything. On devices with multiple users, you may need to specify --user: adb shell pm clear --user 0 com.example.app Clears data for the specified app. Replace com.example.app with the target app package.
pt_br: adb shell pm clear nome.do.pacote 📌 O que faz: Esse comando limpa todos os dados e cache de um aplicativo, como se você tivesse ido em "Configurações > Apps > Limpar dados". ✅ Funciona em: Todas as versões modernas do Android, desde o Android 5.0 (Lollipop) até o 14 (com algumas variações). Desde que o app esteja instalado no usuário corrente (geralmente o usuário 0). ⚠️ Limitações: Em Android 11+ (API 30+), alguns apps protegidos pelo sistema ou de perfil corporativo podem não ser limpos. Se o app for um app de sistema, pode ser necessário usar root para limpar tudo. Em dispositivos com múltiplos usuários, você pode precisar especificar o --user: adb shell pm clear --user 0 com.exemplo.app Limpa dados do app especificado. Substitua com.exemplo.app pelo pacote do app alvo.

source: Reset via ADB using recovery (universal method) This method works on most Androids (any version, 5 to 15) if you have access to recovery mode via ADB. 📦 Steps: Reboot to recovery: adb reboot recovery In recovery, use the volume and power buttons to navigate and select: "Wipe data/factory reset" → "Yes" 🟢 Compatible with: All devices with stock recovery (AOSP) or custom recovery (TWRP, etc.)
pt_br: Reset via ADB usando recovery (método universal) Este método funciona na maioria dos Androids (de qualquer versão, 5 até 15) se você tiver acesso ao modo recovery via ADB. 📦 Passos: Reboot para recovery: adb reboot recovery No recovery, você deve usar os botões de volume e power para navegar e selecionar: "Wipe data/factory reset" → "Yes" 🟢 Compatível com: Todos os dispositivos com recovery padrão (AOSP) ou recovery customizado (TWRP, etc.)

source: Do you want to reset your Android now (enter recovery mode)? This does NOT automatically reset your Android, but it does reboot you into recovery mode. You'll need to reset it manually from the recovery menu.
pt_br: Deseja resetar o Android agora (entrar no modo recovery)? Isso NÃO faz o reset automaticamente, mas reinicia para o recovery. Você precisará fazer o reset manualmente pelo menu de recovery.

source: ⚠️ adb shell settings reset system 📌 What it does: This command resets system settings (such as brightness, sound, airplane mode, etc.) to their default values. ✅ Works on: Android 7.0 to Android 11, in general. On Android devices with full access to the settings command via ADB shell. ⚠️ Warning: On Android 12+, this command may have no visible effect or may return the error: Bad reset mode: system This happens because: The settings reset command has been limited or discontinued in newer versions. The system "namespace" is sometimes not considered valid for resetting on Android 12+. Android is increasingly restrictive of ADB commands that change settings without user consent. 🛠️ Alternatives on modern Android (12+): For newer versions, instead of resetting everything with a single command, you can edit specific settings, such as: adb shell settings put system screen_brightness 150 adb shell settings put global airplane_mode_on 0 adb shell am broadcast -a android.intent.action.AIRPLANE_MODE --ez state false
pt_br: ⚠️ adb shell settings reset system 📌 O que faz: Esse comando reseta as configurações do sistema (como brilho, som, modo avião, etc.) para os valores padrão. ✅ Funciona em: Android 7.0 até Android 11, em geral. Em Androids com permissão de acesso total ao comando settings via ADB shell. ⚠️ Atenção: Em Android 12+, esse comando pode não ter efeito visível ou pode retornar erro: Bad reset mode: system Isso acontece porque: O comando settings reset foi limitado ou descontinuado em versões mais recentes. O "namespace" system às vezes não é considerado válido para reset em Android 12+. O Android está cada vez mais restritivo com comandos ADB que alteram configurações sem consentimento do usuário. 🛠️ Alternativas em Android moderno (12+): Para versões mais novas, em vez de resetar tudo com um só comando, você pode editar configurações específicas, como: adb shell settings put system screen_brightness 150 adb shell settings put global airplane_mode_on 0 adb shell am broadcast -a android.intent.action.AIRPLANE_MODE --ez state false

source: Android %s detected. The 'cmd' command is available.
pt_br: Android %s detectado. O comando 'cmd' está disponível.
