Repository: slackjeff/debloated_Samsung
Catalog: usr/share/doc/debloat-android/locale/debloat-android-*.po
Languages: pt_br

source: Time's up!
pt_br: Tempo esgotado!

source: Android device detected and ADB working
pt_br: Dispositivo Android detectado e ADB funcional

source: No ADB devices detected with USB debugging active and authorized. Check if: - The USB cable is connected correctly. - USB debugging is enabled in developer options. - You have authorized the connection on your phone (ADB dialog box).
pt_br: Nenhum dispositivo ADB detectado com depuração USB ativa e autorizada. Verifique se: - O cabo USB está conectado corretamente. - A depuração USB está ativada nas opções de desenvolvedor. - Você autorizou a conexão no celular (caixa de diálogo ADB).

source: Error: %s is not installed.
pt_br: Erro: %s não está instalado.

source: Checking if emoji fonts are installed...
pt_br: Verificando se fontes de emoji estão instaladas...

source: Emoji font found: %s.
pt_br: Fonte de emoji encontrada: %s.

source: Emoji font NOT found: %s.
pt_br: Fonte de emoji NÃO encontrada: %s.

source: Verification completed for emoji fonts.
pt_br: Verificação concluída para fontes de emoji.

source: WARNING: This is Android version %s. The 'cmd' command is NOT available in this version. Commands like 'cmd package install-existing' will NOT work.
pt_br: ATENÇÃO: Esta é a versão Android %s. O comando 'cmd' NÃO está disponível nessa versão. Comandos como 'cmd package install-existing' NÃO funcionarão.

source: Enter to continue...
pt_br: Enter para continuar...

source: All set to go!
pt_br: Tudo pronto para começar!

source: ⚠️ Use at your own risk! === Starting to unbloat pre-installed apps on Android === This script helps remove bloatware (apps pre-installed by the manufacturer or carrier) from Android devices. ⚠️ ATTENTION This does not completely uninstall the apps, it just disables or removes them for the current user (pm uninstall --user 0). Some apps are essential for basic functionality. Use with caution. This script must be run with the device connected via USB, with USB debugging enabled and with ADB configured on your system. You must have adb (android-tools) installed on your Linux distribution. Make sure Developer Option is ENABLED on your mobile. 🔁 Revert changes? Use: adb shell cmd package install-existing com.package.name ⚠️ Care: Removing with root may void your warranty. Modifying system files can cause a bootloop if done incorrectly. It is recommended to make a full backup first.
pt_br: ⚠️ Use por sua conta e risco! === Iniciando desbloat de apps pré-instalados no Android === Este script auxilia na remoção de bloatware (apps pré-instalados pelo fabricante ou operadora) de dispositivos Android. ⚠️ ATENÇÃO Isso não desinstala completamente os apps, apenas os desativa ou remove para o usuário atual (pm uninstall --user 0). Alguns apps são importantes para funcionalidades básicas. Use com cuidado. Este script deve ser executado com o dispositivo conectado via USB, com a depuração USB ativada e com o ADB configurado no seu sistema. É necessário ter o adb (android-tools) instalado em sua distribuição Linux. Certifique-se de que a Opção do Desenvolvedor esteja HABILITADA em seu celular. 🔁 Reverter mudanças? Use: adb shell cmd package install-existing com.nome.do.pacote ⚠️ Cuidados: Remoção com root pode invalidar a garantia. Modificar arquivos de sistema pode causar bootloop se feito incorretamente. Recomenda-se backup completo antes.

source: Exiting... Cleaning up temporary files.
pt_br: Saindo... Limpando arquivos temporários.

source: Log will be saved to:
pt_br: Log será salvo em:

source: ERROR
pt_br: ERRO

source: Android version detected
pt_br: Versão do Android detectada

source: Error: Could not correctly determine Android version.
pt_br: Erro: não foi possível determinar corretamente a versão do Android.

source: Error. Please install adb (android-tools).
pt_br: Erro. Instale o adb (android-tools).

source: ADB is not working properly.
pt_br: ADB não está funcionando corretamente.

source: Device not authorized. Authorize the device on your phone screen.
pt_br: Dispositivo não autorizado. Autorize o dispositivo na tela do seu celular.

source: Folder '/etc/debloat-android/' not found.
pt_br: Pasta '/etc/debloat-android/' não encontrada.

source: Checking connected devices...
pt_br: Checando os dispositivos conectados...

source: I didn't find any devices. Plug your phone into your computer.
pt_br: Não encontrei nenhum dispositivo. Plugue seu celular no computador.

source: Connected devices
pt_br: Dispositivos conectados

source: File generated in
pt_br: Arquivo gerado em

source: ANDROID DEVICE INFORMATION
pt_br: INFORMAÇÕES DO DISPOSITIVO ANDROID

source: Manufacturer
pt_br: Fabricante

source: Model
pt_br: Modelo

source: Android version
pt_br: Versão do Android

source: Build Number
pt_br: Número da Build

source: CPU Architecture
pt_br: Arquitetura da CPU

source: Device Name
pt_br: Nome do Dispositivo

source: Product Name
pt_br: Nome do Produto

source: Platform
pt_br: Plataforma

source: Low (probably 512 MB or 1 GB)
pt_br: Baixa (provavelmente 512 MB ou 1 GB)

source: Unknown
pt_br: Desconhecido

source: Storage
pt_br: Armazenamento

source: Absent
pt_br: Ausente

source: Present
pt_br: Presente

source: Language
pt_br: Idioma

source: System
pt_br: Sistema

source: Bootloader
pt_br: Carregador de inicialização

source: Baseband
pt_br: Banda base

source: Security Patch
pt_br: Patch de segurança

source: VPN version
pt_br: Versão VPN

source: Active
pt_br: Ativo

source: region
pt_br: região

source: Time zone
pt_br: Fuso Horário

source: USB Configuration
pt_br: Configuração USB

source: Build Date
pt_br: Data da Build

source: Serial number
pt_br: Número de série

source: Total packages
pt_br: Total de pacotes

source: Currently installed packages
pt_br: Pacotes instalados atualmente

source: Information saved in
pt_br: Informações salvas em

source: Enter to return to the main menu...
pt_br: Enter para voltar ao menu principal...

source: Improve Battery, Performance and disable GPS Apps.
pt_br: Melhore a Bateria, Performance e desative os Apps GOS.

source: Disabling the GOS application...
pt_br: Desabilitando o aplicativo GOS...

source: GOS application disabled successfully!
pt_br: Aplicativo GOS desabilitado com sucesso!

source: Failed to disable GOS application.
pt_br: Falha ao desabilitar o aplicativo GOS.

source: Initial Adjustments completed successfully.
pt_br: Ajustes Iniciais finalizado com êxito.

source: Starting removal of pre-installed bloatware...
pt_br: Iniciando remoção de bloatware pré-instalado...

source: Basic Cleaning
pt_br: Limpeza Básica

source: Cleanup of legacy Samsung and carrier apps
pt_br: Limpeza de Apps legados da Samsung e de operadoras

source: Basic Cleaning completed successfully.
pt_br: Limpeza Básica finalizada com êxito.

source: Removal complete. Restart your device to finish.
pt_br: Remoção concluída. Reinicie o aparelho para finalizar.

source: Moderate Cleaning
pt_br: Limpeza Moderada

source: Moderate Cleaning completed successfully.
pt_br: Limpeza Moderada finalizada com êxito.

source: Are you sure you want to apply the heavy cleaning? [action is irreversible] (y/N)
pt_br: Você tem certeza que quer aplicar a limpeza pesada? [ação é irreversível] (s/N)

source: Starting Heavy Cleaning
pt_br: Iniciando Limpeza Pesada

source: Successfully removed
pt_br: Removido com sucesso

source: [ADB] Running: adb shell cmd package install-existing com.sec.android.soagent
pt_br: [ADB] Executando: adb shell cmd package install-existing com.sec.android.soagent

source: [ADB] Running: adb shell cmd package install-existing com.sec.android.systemupdate
pt_br: [ADB] Executando: adb shell cmd package install-existing com.sec.android.systemupdate

source: Heavy cleaning completed successfully.
pt_br: Limpeza pesada finalizada com êxito.

source: Enter the name of the package to restore (example: com.android.chrome)
pt_br: Digite o nome do pacote a restaurar (exemplo: com.android.chrome)

source: No package reported.
pt_br: Nenhum pacote informado.

source: Android < 6.0 detected. Using 'pm enable'...
pt_br: Android < 6.0 detectado. Usando 'pm enable'...

source: Check if the App is still in the system
pt_br: Verificar se o App ainda está no sistema

source: Starting game cleanup
pt_br: Iniciando limpeza de jogos

source: Unable to get Android version.
pt_br: Não foi possível obter a versão do Android.

source: Android SDK version
pt_br: Versão do SDK do Android

source: Which AdGuard DNS do you want to configure?
pt_br: Qual DNS do AdGuard deseja configurar?

source: AdGuard Standard
pt_br: AdGuard padrão

source: AdGuard Family Protection
pt_br: Proteção Familiar AdGuard

source: Choose an option
pt_br: Escolha uma opção

source: Restarting Wi-Fi...
pt_br: Reiniciando Wi-Fi...

source: AdGuard DNS successfully configured!
pt_br: DNS do AdGuard configurado com sucesso!

source: Invalid option.
pt_br: Opção inválida.

source: Do you want to continue removing bloatware for manufacturer
pt_br: Deseja continuar com a remoção de bloatware para o fabricante

source: Operation cancelled by the user.
pt_br: Operação cancelada pelo usuário.

source: Killing adb server...
pt_br: Matando o servidor adb...

source: Bloatware Removal Tool via ADB
pt_br: Ferramenta de Remoção de Bloatware via ADB

source: Initial Settings → Configure AdGuard DNS and other optimizations
pt_br: Ajustes Iniciais → Configurar o DNS AdGuard e outras otimizações

source: Basic Cleanup → Removes lightweight apps; keeps Samsung Account, Galaxy AI
pt_br: Limpeza Básica → Remove apps leves; mantém Samsung Account, Galaxy AI

source: Moderate Cleanup → For users who don't have a Samsung account
pt_br: Limpeza Moderada → Para usuários que não usam conta Samsung

source: Deep Cleanup → Full System Optimization (removes games and more)
pt_br: Limpeza Pesada → Otimização total do sistema (remove jogos e mais)

source: Restore App → Reinstalls previously removed apps
pt_br: Restaurar aplicativo → Reinstala aplicativos removidos anteriormente

source: List Apps → Shows all apps installed on the device
pt_br: Listar aplicativos → Mostra todos os aplicativos instalados no aparelho

source: Application Management → Remove or disable an application
pt_br: Gerência Aplicativo → Remover ou desativar um aplicativo

source: Backup → Automated Backup via ADB
pt_br: Backup → Backup Automatizado via ADB

source: Reset via ADB using recovery → (universal method)
pt_br: Reset via ADB usando recovery → (método universal)

source: Restart your phone
pt_br: Reiniciar o celular

source: Clear an app's cache or data
pt_br: Limpar cache ou dados de um aplicativo

source: Reset system settings (such as brightness, sound, airplane mode, etc.) to default values
pt_br: Resetar as configurações do sistema (como brilho, som, modo avião, etc.) para os valores padrão

source: Record Screen or Take a Print
pt_br: Gravar Tela ou Tirar Print

source: Quick Diagnostics → Detailed information about battery, Wi-Fi, system and logs
pt_br: Diagnóstico Rápido → Informações detalhadas sobre bateria, Wi-Fi, sistema e logs

source: Format the device
pt_br: Formata o aparelho

source: Exit → Terminates the script
pt_br: Sair → Encerra o script

source: Only numbers.
pt_br: Somente números.

source: Failed to remove: %s - Reason: %s
pt_br: Falha ao remover: %s - Motivo: %s

source: Successfully removed: %s
pt_br: Removido com sucesso: %s

source: Manufacturer detected: %s
pt_br: Fabricante detectado: %s

source: The configuration file '%s' was not found.
pt_br: O arquivo de configuração '%s' não foi encontrado.

source: Starting removal of pre-installed bloatware (%s)...
pt_br: Iniciando remoção de bloatware pré-instalado (%s)...

source: [ADB] Running: adb shell -n pm uninstall --user 0 %s
pt_br: [ADB] Executando: adb shell -n pm uninstall --user 0 %s

source: The configuration file %s was not found.
pt_br: O arquivo de configuração %s não foi encontrado.

source: [ADB] Running: adb shell -n settings put global %s
pt_br: [ADB] Executando: adb shell -n settings put global %s

source: Restoring package: %s ...
pt_br: Restaurando pacote: %s ...

source: Restore removed application (user 0)
pt_br: Restaurar aplicativo removido (usuário 0)

source: [ADB] Running: adb shell cmd package install-existing %s ...
pt_br: [ADB] Executando: adb shell cmd package install-existing %s ...

source: Application %s restored successfully.
pt_br: Aplicativo %s restaurado com sucesso.

source: Failed to restore application %s.
pt_br: Falha ao restaurar o aplicativo %s.

source: [ADB] Running: adb shell pm install-existing %s ...
pt_br: [ADB] Executando: adb shell pm install-existing %s ...

source: [ADB] Running: adb shell pm enable %s ...
pt_br: [ADB] Executando: adb shell pm enable %s ...

source: Tip
pt_br: Dica

source: use 'adb shell pm list packages' to list all available packages on the system.
pt_br: use 'adb shell pm list packages' para listar todos os pacotes disponíveis no sistema.

source: Applying configuration with DNS: %s...
pt_br: Aplicando configuração com DNS: %s...

source: Install an APK manually If the App is actually uninstalled or corrupted, the most viable alternative without root is: Download the APK compatible with your Android version. - https://www.apkmirror.com/ Transfer to mobile. Enable "Unknown sources". Install the app manually. ⚠️ But be careful: Unlike the Play Store, you take the risk when installing manually. You need to enable "Unknown Sources", which opens a temporary security backdoor. You may install an incompatible version if you don't choose the right APK for your architecture (example: %s).
pt_br: Instalar um APK manualmente Se o App estiver realmente desinstalado ou corrompido, a alternativa mais viável sem root é: Baixe o APK compatível com a versão do Android. - https://www.apkmirror.com/ Transfira para o celular. Ative "Fontes desconhecidas". Instale o app manualmente. ⚠️ Mas atenção: Diferente da Play Store, você assume o risco ao instalar manualmente. Você precisa ativar "Fontes desconhecidas", o que abre uma porta temporária de segurança. Pode instalar uma versão incompatível se não escolher o APK certo para sua arquitetura (exemplo: %s).

source: Games considered potentially dangerous or malicious, which have already been detected as viruses, adware, spyware, or Trojans in security analyses. ❗ Some of these apps have been removed from the Play Store, but may still be circulating via APKs or alternative stores. Some may even use generic icons and names, making them difficult to identify. You can also install reliable security apps such as: Malwarebytes Panda Antivirus Avoid downloading APKs from third-party sites (unofficial sites), as they may contain viruses.
pt_br: Jogos considerados potencialmente perigosos ou maliciosos, que já foram detectados como vírus, adware, spyware, ou trojans em análises de segurança. ❗ Alguns desses apps foram removidos da Play Store, mas podem ainda estar circulando via APKs ou lojas alternativas. Alguns podem até usar ícones e nomes genéricos, dificultando a identificação. Você também pode instalar apps confiáveis de segurança como: Malwarebytes Panda Antivirus Evite baixar APKs de terceiros (sites não oficiais), pois esses podem conter vírus.

source: Disabling automatic sending of application error reports on Android... [ADB] Running: adb shell settings put secure send_action_app_error 0
pt_br: Desativando o envio automático de relatórios de erro de aplicativos no Android... [ADB] Executando: adb shell settings put secure send_action_app_error 0

source: The %s application is not present on the device. Nothing to do.
pt_br: O aplicativo %s não está presente no dispositivo. Nada a fazer.

source: Application %s is present on the system.
pt_br: Aplicativo %s está presente no sistema.

source: Application %s is NOT present on the system.
pt_br: Aplicativo %s NÃO está presente no sistema.

source: Cannot restore because the package is not installed.
pt_br: Não é possível restaurar porque o pacote não está instalado.

source: Application %s restored successfully (root mode).
pt_br: Aplicativo %s restaurado com sucesso (modo root).

source: 'su' not available or root access denied. Trying without root...
pt_br: 'su' não disponível ou acesso root negado. Tentando sem root...

source: Error encountered: %s
pt_br: Erro encontrado: %s

source: The 'pm enable' command requires root on Android < 6.0. Device may not be rooted.
pt_br: O comando 'pm enable' requer root em Android < 6.0. Dispositivo pode não estar rooteado.

source: Alternative on Android itself (no PC, no root): You can: Open the "My Files" or "File Manager" app. Navigate to the folder where the app is located. Tap the APK. Allow installation from unknown sources. Install normally. ❗ Important tip: After installing the APK manually, the app may not update via the Play Store if the signatures are different (the app will be marked as "unofficial").
pt_br: Alternativa no próprio Android (sem PC, sem root): Você pode: Abrir o app "Meus Arquivos" ou "Gerenciador de Arquivos". Navegar até a pasta onde esta o aplicativo. Tocar no APK. Permitir instalação de fontes desconhecidas. Instalar normalmente. ❗ Dica importante: Após instalar o APK manual, o aplicativo pode não atualizar via Play Store se as assinaturas forem diferentes (o app ficará como "não oficial"

source: Android version %s does not support DNS-over-TLS. Android 9 (API 28) or higher is required.
pt_br: Android versão %s não é compatível com DNS-over-TLS. É necessário Android 9 (API 28) ou superior.

source: Uninstalling: %s
pt_br: Desinstalando: %s

source: Application
pt_br: Aplicativo

source: Adjustment
pt_br: Ajuste

source: Reativando serviços essenciais do sistema (se necessário)...
pt_br: Re-enabling essential system services (if needed)...

source: Application Manager via ADB
pt_br: Gerenciador de aplicativos via ADB

source: Enter the name of the application (example: com.sec.android.usermanual)
pt_br: Digite o nome do aplicativo (exemplo: com.sec.android.usermanual)

source: Uninstall for the current user (--user 0)
pt_br: Desinstalar para o usuário atual (--user 0)

source: Disable (disable-user)
pt_br: Desativar (disable-user)

source: Cancel
pt_br: Cancelar

source: Removing application for current user...
pt_br: Removendo o aplicativo para o usuário atual...

source: Disabling the application...
pt_br: Desativando o aplicativo...

source: Operation canceled.
pt_br: Operação cancelada.

source: Invalid option. Closing.
pt_br: Opção inválida. Encerrando.

source: Operation completed.
pt_br: Operação concluída.

source: Error: Package '%s' not found on device.
pt_br: Erro: Pacote '%s' não encontrado no dispositivo.

source: What do you want to do with the application '%s'?
pt_br: O que você deseja fazer com o aplicativo '%s'?

source: Restart your phone now...
pt_br: Reiniciar o celular agora...

source: Detailed information was saved in /tmp/ADB Reports/
pt_br: Informações detalhadas foram salvas em /tmp/Relatórios ADB/

source: Take a Print
pt_br: Tirar Print

source: Record Screen
pt_br: Gravar Tela

source: Choice
pt_br: Escolha

source: Option
pt_br: Opção

source: Command not executed: Only supported on Android 7 through 11 (API 24–30). Current version: %s
pt_br: Comando não executado: compatível apenas com Android 7 até 11 (API 24–30). Versão atual: %s

source: Automated Backup via ADB
pt_br: Backup Automatizado via ADB

source: Choose the backup type
pt_br: Escolha o tipo de backup

source: Full backup (ADB backup – up to Android 11 - older devices)
pt_br: Backup completo (ADB backup – até Android 11 - dispositivos antigos)

source: Backup only personal files (/sdcard) - [best option]
pt_br: Backup apenas de arquivos pessoais (/sdcard) - [melhor opção]

source: Backup only installed APKs
pt_br: Backup apenas dos APKs instalados

source: Starting full backup via adb backup...
pt_br: Iniciando backup completo via adb backup...

source: Backup saved in: %s/full_backup.ab
pt_br: Backup salvo em: %s/full_backup.ab

source: This method has been deprecated in Android 12+. Use option 2 or 3.
pt_br: Este método foi descontinuado no Android 12+. Use opção 2 ou 3.

source: Backing up files from internal memory...
pt_br: Fazendo backup de arquivos da memória interna...

source: Files copied to: %s/sdcard
pt_br: Arquivos copiados para: %s/sdcard

source: Extracting list of installed applications...
pt_br: Extraindo lista de aplicativos instalados...

source: Saving APK of: %s
pt_br: Salvando APK de: %s

source: APKs saved in: %s/apks
pt_br: APKs salvos em: %s/apks

source: Backup completed successfully.
pt_br: Backup concluído com sucesso.

source: Enter the name of the application (example: com.whatsapp)
pt_br: Digite o nome do aplicativo (exemplo: com.whatsapp)

source: Application '%s' is not installed.
pt_br: Aplicativo '%s' não está instalado.

source: Checking Android version...
pt_br: Verificando versão do Android...

source: Performing factory reset via broadcast (Android %s)...
pt_br: Executando reset de fábrica via broadcast (Android %s)...

source: Press Enter to continue or CTRL+C to cancel...
pt_br: Pressione Enter para continuar ou CTRL+C para cancelar...

source: Rebooting the device into recovery mode...
pt_br: Reiniciando o dispositivo em modo recovery...

source: Device restarted. Use the volume and power buttons to manually perform a factory reset.
pt_br: Dispositivo reiniciado. Use os botões de volume e power para fazer o factory reset manualmente.

source: For reliable resets via ADB, we recommend: Use adb reboot recovery and reset manually. Or use a custom recovery (TWRP). Or use dpm wipe-data with the device manager app.
pt_br: Para resets confiáveis via ADB, recomenda-se: Usar adb reboot recovery e resetar manualmente. Ou usar recovery customizado (TWRP). Ou usar dpm wipe-data com app administrador de dispositivo.

source: ✅ About the adb shell am broadcast -a android.intent.action.MASTER_CLEAR command 📌 What does it do? This command triggers a factory reset intent via ADB, without user confirmation. It's a method used by systems or apps with special permissions (usually system apps or those with "device admin" permission).
pt_br: ✅ Sobre o comando adb shell am broadcast -a android.intent.action.MASTER_CLEAR 📌 O que ele faz? Esse comando dispara uma intenção de redefinição de fábrica (factory reset) via ADB, sem confirmação do usuário. É um método utilizado por sistemas ou apps com permissão especial (geralmente system apps ou com permissão de "admin do dispositivo").
